<?php

/* @var $this yii\web\View */

$this->title = 'Тестовое задание';
?>
<div class="site-index">


    <div class="body-content">
        <h1>Тестовое задание на Yii2</h1>
        <p>Реализовать задачу на стеке PHP + Yii2 +  MySQL</p>
        <p>Сделать веб-приложение «Клиенты»</p>
        <p>Функционал:</p>
        <ul>
            <li>Форма добавления клиента.</li>
            <li>Форма просмотр карточки клиента.</li>
            <li>В карточке клиента возможность удалить клиента из базы / изменить информацию о клиенте.</li>
            <li>Добавить несколько номеров телефонов/удаление телефона/изменение телефона.</li>
            <li>Просмотр всего списка клиентов.</li>
            <li>Поиск по номеру телефона или фамилии.</li>
        </ul>
        <p>Данные, которые необходимо хранить в базе:</p>
        <ul>
            <li>Фамилия</li>
            <li>Имя</li>
            <li>Отчество</li>
            <li>Дата рождения</li>
            <li>Пол</li>
            <li>Дата создания записи</li>
            <li>Дата обновления записи</li>
            <li>Телефоны клиента</li>
        </ul>
        <p>Код выложить на Github, сопроводив проект инструкцией в REAMDE по его развертыванию</p>
    </div>
</div>
